load-test/jmeter.log
2026-05-16 22:59:37,739 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2026-05-16 22:59:37,752 INFO o.a.j.JMeter: Loading user properties from: C:\Users\Foxi8\OneDrive\Рабочий стол\4 КУРС\Тестирование\apache-jmeter-5.6.3\bin\user.properties
2026-05-16 22:59:37,752 INFO o.a.j.JMeter: Loading system properties from: C:\Users\Foxi8\OneDrive\Рабочий стол\4 КУРС\Тестирование\apache-jmeter-5.6.3\bin\system.properties
2026-05-16 22:59:37,756 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2026-05-16 22:59:37,756 INFO o.a.j.JMeter: Version 5.6.3
2026-05-16 22:59:37,756 INFO o.a.j.JMeter: java.version=17.0.17
2026-05-16 22:59:37,756 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2026-05-16 22:59:37,756 INFO o.a.j.JMeter: os.name=Windows 10
2026-05-16 22:59:37,756 INFO o.a.j.JMeter: os.arch=amd64
2026-05-16 22:59:37,756 INFO o.a.j.JMeter: os.version=10.0
2026-05-16 22:59:37,756 INFO o.a.j.JMeter: file.encoding=Cp1251
2026-05-16 22:59:37,757 INFO o.a.j.JMeter: java.awt.headless=true
2026-05-16 22:59:37,757 INFO o.a.j.JMeter: Max memory     =1073741824
2026-05-16 22:59:37,757 INFO o.a.j.JMeter: Available Processors =12
2026-05-16 22:59:37,763 INFO o.a.j.JMeter: Default Locale=English (EN)
2026-05-16 22:59:37,763 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2026-05-16 22:59:37,764 INFO o.a.j.JMeter: JMeterHome=C:\Users\Foxi8\OneDrive\Рабочий стол\4 КУРС\Тестирование\apache-jmeter-5.6.3
2026-05-16 22:59:37,764 INFO o.a.j.JMeter: user.dir  =C:\Users\Foxi8\diplom\web-trainer-platform\load-test
2026-05-16 22:59:37,764 INFO o.a.j.JMeter: PWD       =C:\Users\Foxi8\diplom\web-trainer-platform\load-test
2026-05-16 22:59:37,764 INFO o.a.j.JMeter: IP: 172.18.0.1 Name: DESKTOP-7O4FHO9 FullName: DESKTOP-7O4FHO9
2026-05-16 22:59:37,772 INFO o.a.j.s.FileServer: Default base='C:\Users\Foxi8\diplom\web-trainer-platform\load-test'
2026-05-16 22:59:37,774 INFO o.a.j.s.FileServer: Set new base='C:\Users\Foxi8\diplom\web-trainer-platform\load-test'
2026-05-16 22:59:37,898 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2026-05-16 22:59:37,916 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2026-05-16 22:59:37,918 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2026-05-16 22:59:37,921 INFO o.a.j.s.SaveService: Loading file: web-trainer-test-plan-regex.jmx
2026-05-16 22:59:37,956 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-05-16 22:59:37,956 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-05-16 22:59:37,956 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-05-16 22:59:37,956 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-05-16 22:59:37,956 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2026-05-16 22:59:37,956 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2026-05-16 22:59:37,984 INFO o.a.j.JMeter: Creating summariser <summary>
2026-05-16 22:59:37,994 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2026-05-16 22:59:37,995 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-05-16 22:59:37,995 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-05-16 22:59:37,997 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2026-05-16 22:59:37,997 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2026-05-16 22:59:38,044 INFO o.a.j.r.ClassFinder: Will scan jar C:\Users\Foxi8\OneDrive\Рабочий стол\4 КУРС\Тестирование\apache-jmeter-5.6.3\lib\ext\jmeter-plugins-manager-1.12.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2026-05-16 22:59:38,106 INFO o.a.j.r.ResultCollector: Folder at C:\Users\Foxi8\diplom\web-trainer-platform\load-test\load-test was created
2026-05-16 22:59:38,107 INFO o.a.j.JMeter: Running test (1778961578107)
2026-05-16 22:59:38,116 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Сценарий: Полный путь пользователя
2026-05-16 22:59:38,116 INFO o.a.j.e.StandardJMeterEngine: Starting 10 threads for group Сценарий: Полный путь пользователя.
2026-05-16 22:59:38,116 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2026-05-16 22:59:38,116 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=10 ramp-up=20 delayedStart=false
2026-05-16 22:59:38,123 INFO o.a.j.t.JMeterThread: Thread started: Сценарий: Полный путь пользователя 1-1
2026-05-16 22:59:38,126 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2026-05-16 22:59:38,126 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2026-05-16 22:59:38,642 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = DESKTOP-7O4FHO9
2026-05-16 22:59:38,646 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2026-05-16 22:59:38,646 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2026-05-16 22:59:38,646 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2026-05-16 22:59:38,646 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2026-05-16 22:59:38,646 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2026-05-16 22:59:40,118 INFO o.a.j.t.JMeterThread: Thread started: Сценарий: Полный путь пользователя 1-2
2026-05-16 22:59:42,117 INFO o.a.j.t.JMeterThread: Thread started: Сценарий: Полный путь пользователя 1-3
2026-05-16 22:59:44,119 INFO o.a.j.t.JMeterThread: Thread started: Сценарий: Полный путь пользователя 1-4
2026-05-16 22:59:46,117 INFO o.a.j.t.JMeterThread: Thread started: Сценарий: Полный путь пользователя 1-5
2026-05-16 22:59:48,117 INFO o.a.j.t.JMeterThread: Thread started: Сценарий: Полный путь пользователя 1-6
2026-05-16 22:59:50,117 INFO o.a.j.t.JMeterThread: Thread started: Сценарий: Полный путь пользователя 1-7
2026-05-16 22:59:52,116 INFO o.a.j.t.JMeterThread: Thread started: Сценарий: Полный путь пользователя 1-8
2026-05-16 22:59:54,117 INFO o.a.j.t.JMeterThread: Thread started: Сценарий: Полный путь пользователя 1-9
2026-05-16 22:59:55,710 INFO o.a.j.t.JMeterThread: Thread is done: Сценарий: Полный путь пользователя 1-1
2026-05-16 22:59:55,710 INFO o.a.j.t.JMeterThread: Thread finished: Сценарий: Полный путь пользователя 1-1
2026-05-16 22:59:56,118 INFO o.a.j.t.JMeterThread: Thread started: Сценарий: Полный путь пользователя 1-10
2026-05-16 22:59:58,635 INFO o.a.j.t.JMeterThread: Thread is done: Сценарий: Полный путь пользователя 1-2
2026-05-16 22:59:58,635 INFO o.a.j.t.JMeterThread: Thread finished: Сценарий: Полный путь пользователя 1-2
2026-05-16 23:00:00,246 INFO o.a.j.r.Summariser: summary +    130 in 00:00:22 =    5.9/s Avg:     2 Min:     1 Max:    65 Err:    99 (76.15%) Active: 8 Started: 10 Finished: 2
2026-05-16 23:00:04,052 INFO o.a.j.t.JMeterThread: Thread is done: Сценарий: Полный путь пользователя 1-3
2026-05-16 23:00:04,052 INFO o.a.j.t.JMeterThread: Thread finished: Сценарий: Полный путь пользователя 1-3
2026-05-16 23:00:04,941 INFO o.a.j.t.JMeterThread: Thread is done: Сценарий: Полный путь пользователя 1-4
2026-05-16 23:00:04,941 INFO o.a.j.t.JMeterThread: Thread finished: Сценарий: Полный путь пользователя 1-4
2026-05-16 23:00:07,422 INFO o.a.j.t.JMeterThread: Thread is done: Сценарий: Полный путь пользователя 1-6
2026-05-16 23:00:07,422 INFO o.a.j.t.JMeterThread: Thread finished: Сценарий: Полный путь пользователя 1-6
2026-05-16 23:00:08,010 INFO o.a.j.t.JMeterThread: Thread is done: Сценарий: Полный путь пользователя 1-5
2026-05-16 23:00:08,010 INFO o.a.j.t.JMeterThread: Thread finished: Сценарий: Полный путь пользователя 1-5
2026-05-16 23:00:08,543 INFO o.a.j.t.JMeterThread: Thread is done: Сценарий: Полный путь пользователя 1-7
2026-05-16 23:00:08,543 INFO o.a.j.t.JMeterThread: Thread finished: Сценарий: Полный путь пользователя 1-7
2026-05-16 23:00:13,383 INFO o.a.j.t.JMeterThread: Thread is done: Сценарий: Полный путь пользователя 1-10
2026-05-16 23:00:13,383 INFO o.a.j.t.JMeterThread: Thread finished: Сценарий: Полный путь пользователя 1-10
2026-05-16 23:00:13,839 INFO o.a.j.t.JMeterThread: Thread is done: Сценарий: Полный путь пользователя 1-8
2026-05-16 23:00:13,839 INFO o.a.j.t.JMeterThread: Thread finished: Сценарий: Полный путь пользователя 1-8
2026-05-16 23:00:15,245 INFO o.a.j.t.JMeterThread: Thread is done: Сценарий: Полный путь пользователя 1-9
2026-05-16 23:00:15,246 INFO o.a.j.t.JMeterThread: Thread finished: Сценарий: Полный путь пользователя 1-9
2026-05-16 23:00:15,246 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2026-05-16 23:00:15,247 INFO o.a.j.r.Summariser: summary +     70 in 00:00:15 =    4.7/s Avg:     2 Min:     1 Max:     4 Err:    51 (72.86%) Active: 0 Started: 10 Finished: 10
2026-05-16 23:00:15,247 INFO o.a.j.r.Summariser: summary =    200 in 00:00:37 =    5.4/s Avg:     2 Min:     1 Max:    65 Err:   150 (75.00%)